[
  {
    "id": "equinox",
    "name": "Equinox",
    "role": "Member",
    "dateRange": "Oct 2024 - Present",
    "description": "Engaged in personal fitness and wellness activities, demonstrating a commitment to maintaining a balanced and healthy lifestyle. Participated in group fitness classes, endurance training, and community wellness events."
  },
  {
    "id": "ieee",
    "name": "Institute of Electrical and Electronics Engineers",
    "role": "Member",
    "dateRange": "Sep 2019 - Present",
    "description": "Participated in technical seminars, conferences, and workshops on emerging technologies, with a focus on data science, machine learning, and sustainable development.",
    "association": "Anna University"
  },
  {
    "id": "yrc-org",
    "name": "Youth Red Cross",
    "role": "Volunteer",
    "dateRange": "Sep 2019 - Present",
    "description": "Organized and participated in blood donation drives, health awareness campaigns, and disaster relief efforts, contributing to community welfare and public health initiatives.",
    "association": "Anna University"
  },
  {
    "id": "ds-society",
    "name": "Data Science Society",
    "role": "Member",
    "dateRange": "Aug 2023 - May 2025",
    "description": "Engaged with the data science community through meetups, hackathons, and data-driven projects, contributing to open-source data science initiatives and collaborations.",
    "association": "The George Washington University"
  },
  {
    "id": "ds-sustainable",
    "name": "Data Science for Sustainable Development",
    "role": "Member",
    "dateRange": "Aug 2023 - Feb 2024",
    "description": "Utilized population density metrics and existing datasets to model the correlation between War Fire incidents and resultant window damage. Leveraged Geopandas for geospatial analysis to construct a predictive model amidst data ambiguity.",
    "association": "The George Washington University"
  },
  {
    "id": "iete",
    "name": "Institution of Electronics and Telecommunication Engineers",
    "role": "Member",
    "dateRange": "Aug 2019 - May 2023",
    "description": "Engaged in knowledge-sharing events and conferences, staying updated on the latest trends in telecommunications and electronics engineering.",
    "association": "Anna University"
  }
]
